%1.15
%1.输出该数据的图形。
n = 1770:1869; x = [101,82,66,35,31,7,20,92,154,125,85,68,38,23,10,24,83,132,131,118,90,67,60,47,41 , 21, 16, 6, 4, 7, 14, 34, 45, 43, 48, 42, 28, 10, 8, 2, 0, 1, 5, 12, 14, 35, 46, 41, 30 ,24 , 16, 7, 4, 2, 8, 17, 36, 50, 62, 67, 71, 48, 28, 8, 13, 57, 122, 138, 103, 86, 63, 37, 24, 11, 15 , 40, 62, 98, 124, 96, 66, 64, 54, 39, 21, 7, 4, 23, 55, 94, 96, 77, 59, 44, 47, 30, 16, 7, 37, 74];
subplot(3 ,1 , 1);plot(n , x);grid on;title('太阳黑子年平均出现次数x(n)');xlabel('年份n');ylabel('x(n)'); 
%2.对该数据做自相关函数，输出其自相关函数的图形，观察太阳黑子活动的周期。
Mlag = 100;
rx = xcorr(x , Mlag,'biased');
subplot(3 , 1 ,2);plot(-Mlag : Mlag,rx);grid on;title('x(n)的自相关函数rx(n)');xlabel('m');ylabel('rx(m)'); 
x2 = x -mean(x);
rx2 = xcorr(x2 , Mlag,'biased');
subplot(3 , 1 , 3);plot(-Mlag : Mlag,rx2);grid on;title('x2(n)的自相关函数rx2(n)');xlabel('m');ylabel('rx2(m)'); 


